In [1]:
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

import numpy as np

In [2]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry")
movies = pd.read_csv("http://bit.ly/imdbratings")
orders = pd.read_csv("http://bit.ly/chiporders", sep='\t')
orders['item_price'] = orders["item_price"].str.replace('$', '').astype('float')
stocks = pd.read_csv("http://bit.ly/smallstocks", parse_dates=['Date'])
titanic = pd.read_csv("http://bit.ly/kaggletrain")
ufo = pd.read_csv("http://bit.ly/uforeports", parse_dates=["Time"])

## 1. Show Installed Version

In [3]:
pd.__version__

'1.0.1'

In [4]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : None
python           : 3.7.6.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
machine          : AMD64
processor        : Intel64 Family 6 Model 158 Stepping 9, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : None.None

pandas           : 1.0.1
numpy            : 1.18.1
pytz             : 2019.3
dateutil         : 2.8.1
pip              : 20.0.2
setuptools       : 45.2.0.post20200210
Cython           : 0.29.14
pytest           : 5.3.5
hypothesis       : 5.5.4
sphinx           : 2.4.0
blosc            : None
feather          : None
xlsxwriter       : 1.2.7
lxml.etree       : 4.5.0
html5lib         : 1.0.1
pymysql          : None
psycopg2         : None
jinja2           : 2.11.1
IPython          : 7.12.0
pandas_datareader: None
bs4              : 4.8.2
bottleneck       : 1.3.2
fastparquet      : None
gcsfs            : None
lxml.etree       : 4.5.0
matplotlib       : 3.1.3
numexpr          : 2.7.1
odfpy            : None
openpyxl         : 3.0.3
pandas_gbq       : None
pyarrow          : None
pytables         : None
pytest           : 5.3.5
pyxlsb           : None
s3fs             : None
scipy            : 1.4.1
sqlalchemy       : 1.3.13
tables           : 3.6.1
tabulate         : None
xarray           : None
xlrd             : 1.2.0
xlwt             : 1.3.0
xlsxwriter       : 1.2.7
numba            : 0.48.0

## 2. Create Example DataFrame

In [5]:
df = pd.DataFrame({
    'col_one':[100, 200],
    'col_two':[300, 400]
})
df

   col_one  col_two
0      100      300
1      200      400

In [6]:
pd.DataFrame(np.random.rand(4, 8))

,0,1,2,3,4,5,6,7
0,0.188744,0.295232,0.528737,0.698802,0.750484,0.747052,0.838643,0.552421
1,0.124423,0.900685,0.989270,0.694172,0.927599,0.962279,0.167783,0.723356
2,0.569704,0.333691,0.228821,0.286771,0.084417,0.238637,0.418634,0.632326
3,0.352090,0.983836,0.758763,0.016290,0.135131,0.440376,0.727481,0.188002

In [7]:
pd.DataFrame(np.random.rand(4,8), columns=list('abcdefgh'))

,a,b,c,d,e,f,g,h
0,0.500363,0.093656,0.881860,0.339571,0.234076,0.330255,0.537731,0.811414
1,0.875387,0.018128,0.111122,0.289435,0.868690,0.648589,0.484970,0.920279
2,0.601189,0.176364,0.203471,0.113370,0.258948,0.041857,0.156059,0.404131
3,0.218725,0.282097,0.898441,0.886591,0.172730,0.392319,0.652909,0.805281

## 3. Rename Columns

In [8]:
df

   col_one  col_two
0      100      300
1      200      400

In [9]:
df = df.rename({
    'col_one':'kolom1',
    'col_two' : 'kolom2'
}, axis='columns')
df

   kolom1  kolom2
0     100     300
1     200     400

In [10]:
df.columns = ['col one', 'col two']
df

   col one  col two
0      100      300
1      200      400

In [11]:
df.columns = df.columns.str.replace(' ', '_')
df

   col_one  col_two
0      100      300
1      200      400

In [12]:
df.add_prefix('X_')

   X_col_one  X_col_two
0        100        300
1        200        400

In [13]:
df.add_suffix('_Y')

   col_one_Y  col_two_Y
0        100        300
1        200        400

## 4. Reverse Row Order

In [14]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [15]:
drinks.loc[::-1].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
192,Zimbabwe,64,18,4,4.7,Africa
191,Zambia,32,19,4,2.5,Africa
190,Yemen,6,0,0,0.1,Asia
189,Vietnam,111,2,1,2.0,Asia
188,Venezuela,333,100,3,7.7,South America

In [16]:
drinks.loc[::-1].reset_index(drop=True).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Zimbabwe,64,18,4,4.7,Africa
1,Zambia,32,19,4,2.5,Africa
2,Yemen,6,0,0,0.1,Asia
3,Vietnam,111,2,1,2.0,Asia
4,Venezuela,333,100,3,7.7,South America